{
    "office": 
    [
        {
            "title": "Microsoft Word",
            "desc": "Who doesn't love Microsoft Word? I can easily recreate a hardcopy only document no problem!",
            "img": "word.png"
        },
        {
            "title": "Microsoft Excel",
            "desc": "Whenever I'm using this, I always want to use Python instead. At least I can apply the logic in the same way.",
            "img": "excel.png"
        },
        {
            "title": "Microsoft PowerPoint",
            "desc": "I might make everything on Google Slides and export it as a .pttx. You'll never know if I took that shortcut or not.",
            "img": "powerpoint.png"
        },
        {
            "title": "Notion",
            "desc": "My number one friend in being organized. Heard that many workplaces use this too!.",
            "img": "powerpoint.png"
        }
    ],

    "coding": 
    [
        {
            "title": "Java",
            "desc": "Created games using Greenfoot API during high school. I vagree vhat vits very verbose.",
            "img": "java.png"
        },
        {
            "title": "Python",
            "desc": "Self-taught to use for data analysis. I also love using this to \"scrape\" websites using pyperclip.",
            "img": "python.png"
        },
        {
            "title": "C++",
            "desc": "My mom first told me that pointing is really rude. Now I do it practically.",
            "img": "cpp.png"
        },
        {
            "title": "JavaScript",
            "desc": "ReactJS, NodeJS; Self-taught to create personal projects. I don't know what I'd do if the debugger never existed.",
            "img": "javascript.png"
        },
        {
            "title": "CSS",
            "desc": "This is not fun at first. Currently, still not that fun.",
            "img": "javascript.png"
        },
        {
            "title": "VSCode",
            "desc": "I normally assume that anyone who uses an IDE other than VSCode is x10000000 smarter than me.",
            "img": "powerpoint.png"
        }
    ],

    "devTools": 
    [
        {
            "title": "Git",
            "desc": "Linus Torvalds, you are a legend.",
            "img": "github.png"
        },
        {
            "title": "AutoHotkey",
            "desc": "This is my go-to to deal with repetitive mouse/keyboard use. I can easily automate any workflow using this",
            "img": "ahk.png"
        }
    ],

    "digitalArts": 
    [
        {
            "title": "Adobe Photoshop",
            "desc": "I somehow passed the LinkedIn skills assessment first try",
            "img": "photoshop.png"
        },
        {
            "title": "Figma",
            "desc": "I only know how to use this because I know how to use Photoshop",
            "img": "figma.png"
        },
        {
            "title": "Blender 3D",
            "desc": "I got lots of exposure to keyframing and posing using Minecraft rigs found on the internet. I learned a lot of 2D/3D animation concepts through this software",
            "img": "blender.png"
        },
        {
            "title": "Vegas Pro 15",
            "desc": "This basically implies I also know how to use Adobe Premiere",
            "img": "vegaspro.png"
        }
    ],

    "languages": 
    [
        {
            "title": "French",
            "desc": "Learned through Ontario public school education system, aka I'll stuck in a conversation on the 2nd sentence.",
            "img": "french.png"
        },
        {
            "title": "Simplified Chinese",
            "desc": "Native speaker. That just means I'll get stuck on the 5th sentence instead of the 2nd",
            "img": "chinese.png"
        }
    ]
}