[
    {
        "pos_title": "IT Consultant",
        "company": "Oak Valley Health",
        "duration": "Jan 2023 - Apr 2023",
        "img": "oakvalleyhealth.png",
        "story": "This was my very first internship under the University of Waterloo's co-op program and as such, it was really cool to experience what it was like to work (getting a badge, department co-workers bringing in treats for everyone). I'm glad that it was at my local hospital! I was able to meet lots of new people with great experiences to share (I'm talking about people within the IT department and the hospital's physicians) and pick up lots of things that I'll bring to my next internship. The hospitals under Oak Valley Health were updating to a new browser-based medical software (Meditech Expanse) for the physicians and I was hired to make the transition from the old system to the new one as fluid as possible. These doctors save lots of lives thanks to the medical software they use. It is my opinion that after I assist these physicians with the medical software, I should get an assist for every life they save. I wish I thought of that one, but I need to quote House M.D. S2E4 on this.",
        "desc": 
        [
            "Learned Meditech Expanse within a short time frame to provide on-site customer support",
            "Performed QA and wrote test scripts on Meditech Expanse software to find out that I don't want a career in QA ever",
            "Analyzed large data dumps using Excel to find out I'm not to shabby with Excel after all",
            "Found out that sleep is essentially for the weak during back-to-back night shifts, and that driving at 3AM feels nice"
        ]
    },
    {
        "pos_title": "IT Team Lead",
        "company": "FitMeCanada",
        "duration": "July 2021",
        "img": "fitmecanada.png",
        "story": "Here, I worked with 3 Junior Achievement (JA) advisors to learn all about creating startup companies. FitMeCanada is a JA Company Program startup that aims to assist online shoppers when shopping for clothes. Ever bought some clothing online and then found out that you can't fit into it? Yeah, that's the problem we were targetting. Personally, I'd just suggest to stop buying clothes online when malls still exist. I lead a team of 5 to develop a functional Chrome extension that takes in a user's measurements, analyzes the page they are on, and inform the user if they can fit in that type of clothing! It was a daunting task at first to create a Chrome extension within one week, since nobody knew where to start. With dedication from everyone on my team and myself, all we needed was just 4 days to create a functional prototype!",
        "desc": 
        [
            "Developed a Chrome extension that assists users in apparel online shopping using HTML and JavaScript",
            "Communicated with customer and other team leads to create, organize, and take action on technical and functinal requirements",
            "Developed a highly complex algorithm to obtain the physical dimensions of the apparel the user is browsing (called \"look-at-the-url\")"
        ]
    }
]